tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "mongodb/brew"
brew "bfg"
brew "docker"
brew "exiftool"
brew "fastfetch"
brew "python@3.13"
brew "tesseract"
brew "ffmpeg"
brew "gdb"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "lazygit"
brew "llm"
brew "node"
brew "mysql", restart_service: :changed
brew "neofetch"
brew "neovim"
brew "nmap"
brew "pipx"
brew "pnpm"
brew "powerlevel10k"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "sk"
brew "starship"
brew "stow"
brew "texlive"
brew "tmux"
brew "tree"
brew "typst"
brew "wimlib"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "mongodb/brew/mongodb-community"
cask "android-platform-tools"
cask "colemak-dh"
cask "colemak-dhk"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "intellij-idea-ce"
cask "keycastr"
cask "mongodb-compass"
cask "warp"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "builder.builder"
vscode "dbaeumer.vscode-eslint"
vscode "deinsoftware.vitest-snippets"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vsliveshare.vsliveshare"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "shopify.ruby-lsp"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vitest.explorer"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "zignd.html-css-class-completion"
